# Задание №1
# 📌 Доработаем задачу про броски монеты, игральной кости и случайного числа.
# 📌 Создайте форму, которая предлагает выбрать: монета, кости, числа.
# 📌 Второе поле предлагает указать количество попыток от 1 до 64.

# Задание №2
# 📌 Доработаем задачу 1.
# 📌 Создайте представление, которое выводит форму выбора.
# 📌 В зависимости от переданных значений представление
# вызывает одно из трёх представлений, созданных на
# прошлом семинаре (если данные прошли проверку, конечно же).

# Задание №3
# 📌 Продолжаем работу с авторами, статьями и комментариями.
# 📌 Создайте форму для добавления нового автора в базу данных.
# 📌 Используйте ранее созданную модель Author

# Задание №4
# 📌 Аналогично автору создайте форму добавления новой статьи.
# 📌 Автор статьи должен выбираться из списка (все доступные в
# базе данных авторы).
